app/helpers/welcome_helper.rb

  def user_name_options
    options = {}
    users = User.all
    users.each do |user|
---
SELECT "users".* FROM "users"