app/controllers/welcome_controller.rb

SELECT "users".* FROM "users"
---
  def index
  	@users = User.all.map{|user| user.name}